Repository: 84000/data-translation-memory
Catalog: toh229-v4.tmx
Source language: bo
Languages: en

source: འཇམ་དཔལ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་རི་རབ་ལྟ་བུས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱའི་རྒྱལ་པོའི་མཆོག་ཤཱཀྱ་ཐུབ་པས་གང་ལ་གནས་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: Mañjuśrī, thus-gone Sumerukalpa continued, ‘On what basis did the thus-gone, worthy, perfect Buddha, the greatest of the Śākya kings, Śākyamuni, fully awaken to unexcelled and perfect buddhahood?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ངས་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པ་རི་རབ་ལྟ་བུས་གང་ལ་གནས་ཏེ་འགྲོ་བ་དྲུག་སྟོན་པ་དེ་ལ་གནས་ནས་ཁོ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: I replied, ‘I fully awakened to unexcelled and perfect buddhahood on the same basis from which the thus-gone Sumerukalpa teaches the six classes of beings.’

source: །འཇམ་དཔལ་གཞན་ཡང་ཤར་ཕྱོགས་ལོགས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀུན་ཏུ་མེ་ཏོག་ཅེས་བྱ་བ་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏེ།
en: Furthermore, Mañjuśrī, in the east, the thus-gone, worthy, perfect Buddha Samantakusuma resides, flourishes, prospers, and teaches Dharma.

source: དེ་ལ་ངས་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀུན་ཏུ་མེ་ཏོག་གིས་གང་ལ་གནས་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ལ།
en: I asked him, ‘On what basis did the thus-gone, worthy, perfect Buddha Samantakusuma fully awaken to unexcelled and perfect buddhahood?

source: སངས་རྒྱས་ཀྱི་ཞིང་འདི་ཡང་ཇི་ལྟར་མངོན་པར་བསྒྲུབས།
en: Furthermore, how was this buddha field manifested?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀུན་ཏུ་མེ་ཏོག་གིས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཁོ་བོ་དང་པོ་སེམས་བསྐྱེད་པ་ལ་གནས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ལ།
en: Mañjuśrī, the thus-gone, worthy, perfect Buddha Samantakusuma replied, ‘I fully awakened to unexcelled and perfect buddhahood on the basis of the first arousal of the intention to attain awakening.

source: སྒྱུ་མའི་སྐྱེས་བུས་རྣམ་པར་ཐར་པ་བརྒྱད་ཇི་ལྟར་མངོན་པར་བསྒྲུབས་པ་དེ་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ཡང་མངོན་པར་བསྒྲུབས་སོ། །
en: This buddha field was manifested in the same way that illusory beings have manifested the eight liberations.’ ”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་མེ་ཏོག་དེས་དང་པོ་སེམས་བསྐྱེད་པ་ལ་གནས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ལགས།
en: Then youthful Mañjuśrī asked the Blessed One, “Blessed One, how did the thus-gone Samantakusuma fully awaken to unexcelled and perfect buddhahood on the basis of the first arousal of the intention to attain awakening?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་དང་པོའི་སེམས་གང་ཡིན་པ་དེ་ཡང་མ་སྐྱེས་པ་ཡིན་ལ། ད་ལྟར་གྱི་དེ་ཡང་མ་སྐྱེས་པ་ཡིན་ཏེ།
en: The Blessed One replied, “Mañjuśrī, that arousal of the intention to attain awakening is unarisen, and it is also not arising now.

source: དང་པོའི་སེམས་བསྐྱེད་པ་དེ་ལྟ་བུ་ལ་གནས་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀུན་ཏུ་མེ་ཏོག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: So, the thus-gone, worthy, perfect Buddha Samantakusuma fully awakened to unexcelled and perfect buddhahood on the basis of the first arousal of the intention to attain awakening, which is like that.

source: །འཇམ་དཔལ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་མེ་ཏོག་གིས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པ་ཤཱཀྱའི་རྒྱལ་པོའི་མཆོག་ཤཱཀྱ་ཐུབ་པས་ཅི་ལ་གནས་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: Moreover, Mañjuśrī, the thus-gone Samantakusuma asked me, ‘On what basis did the Thus-Gone One, the greatest of the Śākya kings, Śākyamuni, fully awaken to unexcelled and perfect buddhahood?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། འཇམ་དཔལ་ངས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །གང་ལ་གནས་ནས་ཆགས་པ་ཐམས་ཅད་ཤེས་པ་དེ་ལ་གནས་ནས་ཁོ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: Mañjuśrī, I replied to that thus-gone one that I fully awakened to unexcelled and perfect buddhahood on the basis upon which all desires are known.

source: །འཇམ་དཔལ་གཞན་ཡང་ཤར་ཕྱོགས་ལོགས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མྱ་ངན་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པ་ཞེས་བྱ་བ་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏེ་དེ་ལ་ངས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Furthermore, Mañjuśrī, in the east, the thus-gone, worthy, perfect Buddha Transcendent Over All Misery resides, flourishes, prospers, and teaches Dharma.

source: །དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པ་ཅི་ལ་གནས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: I asked him, ‘On what basis did the thus-gone Transcendent Over All Misery fully awaken to unexcelled and perfect buddhahood?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་དེས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བྱིས་པ་སོ་སོའི་སྐྱེ་བོའི་སྲིད་པ་མངོན་པར་འགྲུབ་པ་གང་ལ་གནས་པ་དེ་ལ་གནས་ཏེ། ཁོ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: The Thus-Gone One told me, ‘I fully awakened to unexcelled and perfect buddhahood based on that which is the basis for the manifestation of existence for childish, ordinary beings.’

source: །འཇམ་དཔལ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པ་ཤཱཀྱའི་རྒྱལ་པོའི་མཆོག་ཤཱཀྱ་ཐུབ་པས་གང་ལ་གནས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: Moreover, Mañjuśrī, the thus-gone Transcendent Over All Misery asked me, ‘On what basis did the Thus-Gone One, the greatest of the Śākya kings, Śākyamuni, fully awaken to unexcelled and perfect buddhahood?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ངས་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཁོར་བ་ན་འཁོར་བའི་ཚེ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་མཐའ་མི་མངོན་པ་གང་ལ་གནས་པ་དེ་ལ་གནས་ཏེ། ཁོ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: I replied, ‘I fully awakened to unexcelled and perfect buddhahood based on that which is the basis for the indiscernible beginning of all beings as they rotate through saṃsāra.’

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །འཁོར་བ་ན་འཁོར་བའི་ཚེ་གང་ལ་གནས་ཏེ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་མཐའ་མི་མངོན་ལགས།
en: ” Youthful Mañjuśrī asked the Blessed One, “What is the basis for the indiscernible beginning of all beings as they rotate through saṃsāra?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་མ་རིག་པ་ལ་གནས་ནས་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་མཐའ་མི་མངོན་ནོ།
en: The Blessed One replied, “Mañjuśrī, it is upon ignorance that the indiscernible beginning of all childish, ordinary beings is based.”

source: །འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་སྔོན་གྱི་མཐའ་མི་མངོན་ལགས།
en: Mañjuśrī asked, “Blessed One, why is the beginning indiscernible?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་འདི་ལྟར་ཆོས་ཐམས་ཅད་ནི་དངོས་པོ་མེད་པ་སྟེ།
en: The Blessed One replied, “It is like this, Mañjuśrī: all phenomena lack substance.

source: དངོས་པོ་མེད་པ་ལ་གནས་ནས་ཁོ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: I fully awakened to unexcelled and perfect buddhahood on the basis of that lack of substance.”

source: །འཇམ་དཔལ་གྱིས་གསོལ་པ། དེ་བཞིན་གཤེགས་པ་ཏིང་ངེ་འཛིན་ཇི་ལྟ་བུ་ཞིག་ལ་གནས་ནས་ཆོས་འདི་དག་ལ་ཡང་དག་པར་བགྲོ་བ་མཛད།
en: Mañjuśrī asked, “Thus-Gone One, based on what absorption did you discuss these topics?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་བསམ་གྱིས་མི་ཁྱབ་ཅིང་དྲི་མ་མེད་པ་ཤིན་ཏུ་ཡོངས་སུ་དཀར་བའི་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་ལ་གནས་ནས་དེ་བཞིན་གཤེགས་པ་རྣམས་ཆོས་འདི་དག་ལ་བགྲོ་བ་མཛད་དོ།
en: The Blessed One responded, “Mañjuśrī, the thus-gone ones discuss these topics by abiding in the inconceivable and stainless absorption of the completely pure seal.

source: །འཇམ་དཔལ་སངས་རྒྱས་ཀྱི་སྐུ་གཅིག་ཀྱང་མེད་མོད་ཀྱི། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ན་སངས་རྒྱས་ཀྱི་སྐུ་ཐ་དད་པ་ཡང་སྣང་ངོ་།
en: Mañjuśrī, even if there is not a single embodied buddha present, if one rests in that absorption, several embodied buddhas will appear.

source: །འཇམ་དཔལ་སངས་རྒྱས་ཀྱི་ཞིང་གཅིག་ཀྱང་མེད་མོད་ཀྱི། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ན་སངས་རྒྱས་ཀྱི་ཞིང་ཐ་དད་པ་ཡང་སྣང་ངོ་།
en: Mañjuśrī, even if there is not a single buddha field present, if one rests in that absorption, a variety of buddha fields will appear.

source: །འཇམ་དཔལ་ཉན་ཐོས་གཅིག་ཀྱང་མེད་མོད་ཀྱི། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ན་ཉན་ཐོས་ཐ་དད་པ་ཡང་སྣང་ངོ་།
en: Mañjuśrī, even if there is not a single hearer present, if one rests in that absorption, a variety of hearers will appear.

source: །འཇམ་དཔལ་སངས་རྒྱས་ཀྱི་གསུང་གཅིག་ཀྱང་མེད་མོད་ཀྱི། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ན་སངས་རྒྱས་ཀྱི་གསུང་ཐ་དད་པ་ཡང་གྲག་གོ།
en: Mañjuśrī, even if there is absolutely no buddha speech in existence, if one rests in that absorption, a variety of buddha speech will resound.

source: །འཇམ་དཔལ་རྣམ་པར་རིག་པ་གཅིག་ཀྱང་མེད་མོད་ཀྱི། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ན་རྣམ་པར་རིག་པ་ཐ་དད་པ་ཡང་བྱེད་དོ།
en: Mañjuśrī, even if there is not a single piece of knowledge present, if one rests in that absorption, a variety of things will be known.

source: །འཇམ་དཔལ་སེམས་ཅན་གཅིག་ཀྱང་མེད་མོད་ཀྱི། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ན་སེམས་ཅན་མང་པོ་དེ་དག་ཀྱང་རྣམ་པར་གྲོལ་བར་འགྱུར་རོ།
en: Mañjuśrī, even if there is not a single being present, if one rests in that absorption, many beings will be liberated.”

source: །འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཨ་ལ་ལ་ཏིང་ངེ་འཛིན་འདི་ནི་རྒྱ་ཆེ་བ་ལགས་སོ།
en: Mañjuśrī said, “Blessed One, how wonderful! This absorption is so vast!

source: །བཅོམ་ལྡན་འདས་ཨ་ལ་ལ་ཏིང་ངེ་འཛིན་འདི་ནི་བསམ་གྱིས་མི་ཁྱབ་པ་ལགས་སོ།
en: Blessed One, how wonderful—this absorption is inconceivable!

source: །བཅོམ་ལྡན་འདས་ཨ་ལ་ལ་ཏིང་ངེ་འཛིན་འདི་ནི་ཆགས་པ་མ་མཆིས་པ་ལགས་སོ།
en: Blessed One, how wonderful—this absorption is unobstructed!

source: །བཅོམ་ལྡན་འདས་ཨ་ལ་ལ་ཏིང་ངེ་འཛིན་འདི་ནི་རྟོགས་པར་དཀའ་བ་ལགས་སོ།
en: Blessed One, how wonderful—this absorption is difficult to comprehend!

source: །བཅོམ་ལྡན་འདས་ཨ་ལ་ལ་ཏིང་ངེ་འཛིན་འདི་ནི་ཟབ་པ་ལགས་སོ།
en: Blessed One, how wonderful—this absorption is profound!

source: །བཅོམ་ལྡན་འདས་ཨ་ལ་ལ་ཏིང་ངེ་འཛིན་འདི་ནི་ཤིན་ཏུ་འདས་པ་ལགས་སོ།
en: Blessed One, how wonderful—this absorption is transcendent!”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་དེ་དེ་བཞིན་ནོ། །ཇི་སྐད་སྨྲས་པ་བཞིན་ཏེ།
en: The Blessed One responded, “Mañjuśrī, it is like that; it is just as you have said.

source: འཇམ་དཔལ་ཏིང་ངེ་འཛིན་འདི་ནི་རྒྱ་ཆེ་བའོ།
en: Mañjuśrī, this absorption is vast.

source: །འཇམ་དཔལ་ཏིང་ངེ་འཛིན་འདི་ནི་བསམ་གྱིས་མི་ཁྱབ་པའོ།
en: Mañjuśrī, this absorption is inconceivable.

source: །འཇམ་དཔལ་ཏིང་ངེ་འཛིན་འདི་ནི་ཆགས་པ་མེད་པའོ།
en: Mañjuśrī, this absorption is unobstructed.

source: །འཇམ་དཔལ་ཏིང་ངེ་འཛིན་འདི་ནི་རྟོགས་པར་དཀའ་བའོ།
en: Mañjuśrī, this absorption is difficult to comprehend.

source: །འཇམ་དཔལ་ཏིང་ངེ་འཛིན་འདི་ནི་ཟབ་པའོ།
en: Mañjuśrī, this absorption is profound.

source: །འཇམ་དཔལ་ཏིང་ངེ་འཛིན་འདི་ནི་ཤིན་ཏུ་འདས་པའོ།
en: Mañjuśrī, this absorption is transcendent. “

source: །འཇམ་དཔལ་ཏིང་ངེ་འཛིན་འདི་ལ་གནས་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་དྲི་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དུ་ཡང་མི་འགྲོའོ།
en: Mañjuśrī, because of resting in this absorption, I do not go from this buddha field to any other buddha field in order to ask questions to those blessed buddhas.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཀྱང་ངའི་ཐད་དུ་མི་འོང་སྟེ།
en: Likewise, those blessed buddhas do not have to come to me.

source: ང་ཡང་དེ་དག་ལ་འདྲིའོ། །དེ་དག་ཀྱང་ང་ལ་འདྲི་བར་བྱེད་དོ།
en: I ask them questions, and they, likewise, ask me questions.

source: །འོན་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཉིད་ན་གནས་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་དེ་དང་དེ་དག་ན་གནས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་འདྲིའོ།
en: Furthermore, while abiding in this world, I can ask questions to those blessed buddhas who abide in the various other worlds.

source: །འཇིག་རྟེན་གྱི་ཁམས་དེ་དང་དེ་དག་ན་གནས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཀྱང་ང་འདི་ན་གནས་པ་ལ་འདྲི་བར་བྱེད་དོ།
en: Likewise, those blessed buddhas who abide in various other worlds can ask me questions while I abide here.

source: །འཇམ་དཔལ་ང་ཏིང་ངེ་འཛིན་འདི་ལ་གནས་ཏེ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་དབྱངས་ཀྱིས་གོ་བར་བྱེད་དེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་ཐད་དུ་སྒྲ་དེ་སྒྲིབ་པའི་བྱ་བ་མི་བྱེད་དོ།
en: Mañjuśrī, while abiding in this absorption, my voice can be understood in all buddha fields, and that sound reaches those blessed buddhas without interference.

source: །འཇམ་དཔལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཀྱང་ཏིང་ངེ་འཛིན་འདི་ལ་གནས་ཏེ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་དབྱངས་ཀྱིས་གོ་བར་བྱེད་དེ། ང་ལ་ཡང་སྒྲིབ་པར་མི་བྱེད་དོ།
en: Mañjuśrī, while abiding in this absorption, the voices of those blessed buddhas can also be understood in all buddha fields, and they reach me without interference.

source: །འཇམ་དཔལ་ང་ཏིང་ངེ་འཛིན་འདི་ལ་གནས་ཏེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་ལན་ཡང་འདེབས་ལ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཀྱང་ཏིང་ངེ་འཛིན་འདི་ལ་གནས་ན་ང་ལ་ཡང་ལན་འདེབས་སོ།
en: Mañjuśrī, while abiding in this absorption, I can also respond to those blessed buddhas, and while they abide in this absorption they can respond to me. “

source: །འཇམ་དཔལ་འདི་ལྟ་སྟེ། དཔེར་ན་མི་ཞིག་འདི་ནས་སོང་སྟེ་གྲོང་ཁྱེར་ཆེན་པོ་རྒྱ་ཆེ་བ་ཞིག་ཏུ་ཕྱིན་ལ། དེ་དག་གཅིག་ལ་གཅིག་སྨྲ་སྟེ།
en: Mañjuśrī, it is like this analogy: A person might leave from here and go to a large and great city where people are having conversations.

source: དེ་དག་ཕན་ཚུན་སྨྲ་བའི་ཚེ་བྲག་ཅའི་སྒྲ་ཞིག་གྲག་པར་གྱུར་ན།
en: As people are talking to each other, echoing sounds can be heard.

source: འཇམ་དཔལ་འདི་ཇི་སྙམ་དུ་སེམས། དེ་ནི་བྲག་ཅ་ཅིག་ཤོས་ཀྱིས་བྲག་ཅ་གཞན་ལ་གོ་བར་བྱེད་དམ།
en: Tell me, Mañjuśrī—will one such echo communicate with another echo?

source: ཅི་བྲག་ཅ་སྔ་མ་ཤོས་ཀྱི་སྒྲ་བྲག་ཅ་ཕྱི་མ་ཤོས་གཞན་གྱིས་ཤེས་སམ།
en: Or will the former echo be understood by the subsequent echoes?

source: འོན་ཏེ་ཕན་ཚུན་དུ་ཐོས་སམ་ཀུན་ཏུ་ཤེས།
en: Or will they mutually hear or know each other?”

source: འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་བྲག་ཅ་སྔ་མ་ཤོས་དེའི་སྒྲ་དེ་དག་བྲག་ཅ་ཕྱི་མ་ཤོས་ཀྱིས་ཐོས་པའམ་འཚལ་བ་མ་མཆིས་ལགས་སོ།
en: Mañjuśrī responded, “Blessed One, the subsequent echo will not hear or know the sound of the earlier echo.

source: བཅོམ་ལྡན་འདས་བྲག་ཅ་ནི་རྣམ་པར་རིག་པ་མ་མཆིས་པའི་སླད་དུ་སྟེ།
en: Blessed One, it is because echoes do not have conscious awareness.

source: རྣམ་པར་རིག་པ་མ་མཆིས་པ་དེ་ནི་ཡིད་ཀྱི་ཡང་དག་པར་བགྲོ་བའི་དྲི་བའོ།
en: Not having conscious awareness is a topic for discussion by means of the mind.”

source: །འཇམ་དཔལ་གཞན་ཡང་ཤར་ཕྱོགས་ལོགས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀུན་ཏུ་འོད་ཅེས་བྱ་བ་དེ་ལ་ངས་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀུན་ཏུ་འོད་ཀྱིས་གང་ལ་གནས་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: The Blessed One said, “Furthermore, Mañjuśrī, in the east, I asked the thus-gone, worthy, perfect Buddha Samantaprabha, ‘On what basis did the thus-gone, worthy, perfect Buddha Samantaprabha fully awaken to unexcelled and perfect buddhahood?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་འོད་ཀྱིས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འདུ་ཤེས་ལ་བརྟེན་ནས་ཁོ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: Thus-gone Samantaprabha responded to me, ‘I fully awakened to unexcelled and perfect buddhahood by relying on perception.’

source: །དེ་ལ་ངས་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཇི་ལྟར་འདུ་ཤེས་ལ་བརྟེན་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: I then asked, ‘How did you fully awaken to unexcelled and perfect buddhahood by relying on perception?’

source: དེས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འདུ་ཤེས་ལ་གནས་པ་དེ་ཇི་ལྟ་བུ།
en: The Thus-Gone One replied to me, ‘What is being based on perception like?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། འཇམ་དཔལ་ངས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འདུ་ཤེས་ལ་གནས་པ་མེད་དོ། །
en: Mañjuśrī, I responded to that thus-gone one, ‘Being based on perception does not exist.’

source: དེས་སྨྲས་པ། དེ་ལྟར་ན་གནས་པ་མེད་པས་ཁོ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: He said, ‘Therefore, I fully awakened to unexcelled and perfect buddhahood by being without a basis.’

source: །འཇམ་དཔལ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་འོད་ཀྱིས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པ་ཤཱཀྱའི་རྒྱལ་པོའི་མཆོག་ཤཱཀྱ་ཐུབ་པས་གང་ལ་གནས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: Mañjuśrī, thus-gone Samantaprabha continued, ‘On what basis did the Thus-Gone One, the greatest of the Śākya kings, Śākyamuni, fully awaken to unexcelled and perfect buddhahood?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། འཇམ་དཔལ་ངས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་གང་ལ་གནས་པ་དེ་ལ་གནས་ཏེ། ཁོ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: Mañjuśrī, I responded to the Thus-Gone One, ‘I awakened to unexcelled and perfect buddhahood on the basis from which the thus-gone ones prophesy bodhisattvas for unexcelled and perfect awakening.’

source: །འཇམ་དཔལ་གཞན་ཡང་ཤར་ཕྱོགས་ལོགས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀུན་ཏུ་སྲུང་གི་བདག་པོ་སྤྲིན་གྱི་དབང་ཕྱུག་སྒྲོན་མ་ཞེས་བྱ་བ་དེ་ལ་ངས་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་སྲུང་གི་བདག་པོ་སྤྲིན་གྱི་དབང་ཕྱུག་སྒྲོན་མས་གང་ལ་གནས་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: Furthermore, Mañjuśrī, in the east, I asked the thus-gone, worthy, perfect Buddha Lord Protector Cloud-Ruling Lamp, ‘On what basis did the thus-gone Lord Protector Cloud-Ruling Lamp fully awaken to unexcelled and perfect buddhahood?’

source: དེས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་གང་ལ་གནས་པ་དེ་ལ་གནས་ཏེ། ཁོ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: He told me, ‘I fully awakened to unexcelled and perfect buddhahood on the basis of the realm of the inconceivable.’

source: །འཇམ་དཔལ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་དེས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པ་ཤཱཀྱའི་རྒྱལ་པོའི་མཆོག་ཤཱཀྱ་ཐུབ་པས་གང་ལ་གནས་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: Mañjuśrī, the Thus-Gone One continued, ‘On what basis did the Thus-Gone One, the greatest of the Śākya kings, Śākyamuni, fully awaken to unexcelled and perfect buddhahood?’

source: དེ་ལ་ངས་འདི་སྐད་ཅེས་སྨྲས་སོ། །སེམས་ཅན་གྱི་ཁམས་གང་ལ་གནས་པ་དེ་ལ་གནས་ཏེ། ཁོ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: I replied, ‘I fully awakened to unexcelled and perfect buddhahood on the basis of the nature of beings.’

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སེམས་ཅན་གྱི་ཁམས་ཞེས་བགྱི་བ་གང་ལ་གནས་པ་ལགས།
en: ” Youthful Mañjuśrī asked the Blessed One, “Blessed One, where does the so-called ‘nature of beings’ reside?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །འཇམ་དཔལ་དེའི་ཕྱིར་ཁྱོད་ཀྱིས་དོན་དེ་ཉིད་ཤེས་པར་བྱ་བའི་ཕྱིར་དཔེ་བསྟན་པར་བྱའོ།
en: The Blessed One responded to youthful Mañjuśrī, “Mañjuśrī, I will give an analogy so that you can understand this.

source: །དཔེས་བཀའ་སྩལ་བའི་དོན་འདིར་མི་ཁ་ཅིག་གིས་ཤེས་པར་ཡང་འགྱུར་རོ། །
en: Some others will also understand the meaning of this analogy.

source: འཇམ་དཔལ་འདི་ལྟ་སྟེ། དཔེར་ན་སྒྱུ་མ་མཁན་ནམ་སྒྱུ་མ་མཁན་གྱི་སློབ་མ་མཁས་པ་ཞིག་གིས་སྟེང་གི་བར་སྣང་ལ་གླང་པོ་ཆེའི་ཚོགས་དང་། རྟ་པའི་ཚོགས་དང་། ཤིང་རྟའི་ཚོགས་དང་། དཔུང་བུ་ཆུང་གི་ཚོགས་དང་། མིའི་ལུས་དག་སྤྲུལ་ཏེ་འོང་ཞིང་འགྲོ་བའམ། ཡན་ལག་བཞི་པའི་དཔུང་གི་ཚོགས་དག་ཀུན་ཏུ་སྟོན་པར་བྱེད་ན། འཇམ་དཔལ་དེ་ཇི་སྙམ་དུ་སེམས།
en: Mañjuśrī, it is like this analogy: If a magician or a magician’s skilled apprentice conjures a host of elephants, horses, chariots, foot soldiers, and human forms that move back and forth, or if he displays an army of the four kinds of troops, what do you think about that, Mañjuśrī?

source: ཡན་ལག་བཞི་པའི་དཔུང་གི་ཚོགས་དེ་གང་ན་གནས། དཔུང་གི་ཚོགས་བསྟན་པ་གང་ཡིན་པ་གང་ཡང་དེ་ན་སྣང་ངམ།
en: Is that army of the four kinds of troops present somewhere? As that army is displayed, does something appear there?”

source: འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་ཏེ།
en: Mañjuśrī replied, “No, Blessed One.

source: དེ་ན་དཔུང་གི་ཚོགས་ཤིན་ཏུ་མ་མཆིས་ན་སྣང་བར་འགྱུར་བའམ། གང་ན་གནས་པར་འགྱུར་བའམ། མངོན་པ་ལྟ་ག་ལ་ཞིག་མཆིས།
en: If that army is completely nonexistent, how could it manifest, be present, or appear in actuality?” “

source: འཇམ་དཔལ་དེ་བཞིན་དུ་སེམས་ཅན་ནམ། སེམས་ཅན་དུ་བཏགས་པ་ཡང་ཤིན་ཏུ་ཡོད་པ་མ་ཡིན་ན་དེ་ན་གནས་པར་འགྱུར་བ་དང་།
en: Likewise, Mañjuśrī, if beings or those labeled as beings are utterly nonexistent, how could they be present?

source: མངོན་པ་ལྟ་ག་ལ་ཡོད།
en: How could they appear in actuality?

source: འཇམ་དཔལ་གནས་དེ་ལྟ་བུ་ལ་གནས་ཏེ་ང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: Mañjuśrī, it is on such a basis that I fully awakened to unexcelled and perfect buddhahood.

source: །བསྟན་པ་འདི་བཤད་པ་ན་འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ན་སྤྱོད་པའི་ལྷའི་བུ་སྟོང་ཕྲག་དྲུག་ཁྲི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་གོ།
en: When this teaching was given, sixty thousand gods of the desire realm and form realm attained the purified Dharma eye, free from dust and blemish.

source: །བྲམ་ཟེ་ལྷག་པའི་ང་རྒྱལ་ཅན་འབུམ་ཕྲག་སུམ་ཅུ་རྩ་གཉིས་ནི་ལྷག་པའི་ང་རྒྱལ་མེད་པའི་ཤེས་པ་སྐྱེས་སོ།
en: Three million two hundred thousand brahmins with excessive pride developed a mind free from excessive pride.

source: །ལྷའི་བུ་འབུམ་ཕྲག་བཞི་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་སྐྱེས་སོ།
en: Four hundred thousand gods developed acceptance of the unborn nature of phenomena.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེའི་ཚེ་འཛུམ་པ་མཛད་དེ།
en: At this point the Blessed One smiled.

source: འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་གང་གི་ཚེ་འཛུམ་པ་མཛད་པའི་ཆོས་ཉིད་དེ། དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོ་ནས་འོད་ཟེར་ཁ་དོག་སྣ་ཚོགས་ཁ་དོག་དུ་མ་འདི་ལྟ་སྟེ། སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། བཙོད་ཀ་དང་། ཤེལ་དང་། དངུལ་གྱི་ཁ་དོག་ལྟ་བུ་དག་བྱུང་ནས་དེ་དག་གིས་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་དག་འོད་ཀྱིས་ཁྱབ་པར་བྱས་ཏེ།
en: As is the case whenever blessed buddhas smile, a variegated array of blue, yellow, red, white, crimson, crystal, and silver-colored rays of light emanated from his mouth and filled infinite, limitless world systems with light.

source: ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་སོང་ནས་སླར་ལོག་སྟེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་ཏུ་མི་སྣང་བར་གྱུར་ཏོ། །
en: After traveling as far as the abode of Brahmā, the light rays returned, circled the Blessed One three times, and disappeared into the crown of his head.

source: བཅོམ་ལྡན་འདས་ཀྱིས་འཛུམ་པ་མཛད་མ་ཐག་ཏུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དག་འོད་ཀྱིས་སྣང་བར་བྱས་ཤིང་རབ་ཏུ་བརྒྱན་ཏོ།
en: As soon as the Blessed One smiled, all the world systems of the great trichiliocosm were illuminated and filled with bright light.

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་རྒྱུ་མ་མཆིས་རྐྱེན་མ་མཆིས་པར་འཛུམ་པ་མི་མཛད་ན།
en: Youthful Mañjuśrī then said to the Blessed One, “Blessed buddhas do not smile without cause or reason.

source: བཅོམ་ལྡན་འདས་འཛུམ་པ་མཛད་པའི་རྒྱུ་ནི་གང་ལགས།
en: Therefore, what is the cause for the Blessed One’s smile just now?

source: རྐྱེན་ནི་གང་ལགས།
en: What is the reason?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བསྟན་པ་འདི་བཤད་པ་ན་འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ན་སྤྱོད་པའི་ལྷའི་བུ་སྟོང་ཕྲག་དྲུག་ཁྲི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་གོ།
en: The Blessed One responded, “When I gave that teaching, sixty thousand gods of the desire realm and form realm attained the purified Dharma eye, free from dust and blemish.

source: །ལྷའི་བུ་སུམ་ཁྲི་ཉིས་སྟོང་པོ་འདི་དག་ལྷའི་རིས་འདི་ནས་ཤི་འཕོས་ཏེ། དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེ་བར་འགྱུར་ལ།
en: When thirty-two thousand of those gods die and transmigrate from their divine realms, they will be reborn in the buddha field of the thus-gone Akṣobhya.

source: དེ་དག་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དག་ཏུ་ཡང་འགྲོ་བར་འགྱུར་རོ།
en: From that buddha field they will also travel to other buddha fields.
